app/views/questions/_form.html.erb

  <% if @question.new_record? %>
     <% @question.num = Question.last.num+1%>
     <% @question.level = 2 %>
     <% @question.page = Question.where(:level => @question.level).maximum("page")%>
---
SELECT "questions".* FROM "questions" ORDER BY "questions"."id" DESC LIMIT 1
SELECT "questions".* FROM "questions" WHERE "questions"."level" = 2
SELECT MAX("questions"."page") AS max_id FROM "questions" WHERE "questions"."level" = 2

 <div class="field">
   <% for topic in Topic.all(:order => '"topicName"' ) %>
     <%= check_box_tag "question[topic_ids][]", topic.id, @question.topics.include?(topic) %>
---
SELECT "topics".* FROM "topics" ORDER BY "topicName"
SELECT 1 AS one FROM "topics" INNER JOIN "questions_topics" ON "topics"."id" = "questions_topics"."topic_id" WHERE "questions_topics"."question_id" = $1 AND "topics"."id" = 6 LIMIT 1  [["question_id", 845]]