app/views/questions/_form.html.erb

SELECT MAX("questions"."page") AS max_id FROM "questions"
---
     <% @question.num = Question.last.num+1%>
     <% @question.page = Question.maximum("page")%>