app/views/questions/index.html.erb

<%= link_to 'Topics', topics_path, :class => 'btn btn-mini' %>
<%= " There are currently #{Question.count} questions in the list, spread over #{Question.maximum("page")} pages." %>
---
SELECT MAX("questions"."page") AS max_id FROM "questions"

    <% cp = @questions.max { |a, b| a.page <=> b.page } %>
    <% qcp = Question.find_by_num('-1') %>
---
SELECT "questions".* FROM "questions" WHERE "questions"."num" = -1 LIMIT 1

        <% end %>
        <td><%= question.topics.count %></td>
---
SELECT COUNT(*) FROM "topics" INNER JOIN "questions_topics" ON "topics"."id" = "questions_topics"."topic_id" WHERE "questions_topics"."question_id" = $1  [["question_id", 842]]