app/views/questions/show.html.erb

  <%= @question.updated_at.strftime("%m/%d/%y")  %>
  <% nq = Question.where(:level => @question.level).find_by_page_and_num(@question.page,@question.num+1)%> |
---
SELECT "questions".* FROM "questions" WHERE "questions"."page" = 91 AND "questions"."num" = 5 AND "questions"."level" IS NULL LIMIT 1

  <% end %>
  <%= link_to "Edit Next", edit_question_path(Question.find(nid)), :class => 'btn btn-mini' %> |
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", "845"]]

  <strong>Topics:</strong>
  <% @question.topics.each do |t| %>
---
SELECT "topics".* FROM "topics" INNER JOIN "questions_topics" ON "topics"."id" = "questions_topics"."topic_id" WHERE "questions_topics"."question_id" = $1  [["question_id", 845]]