app/views/questions/show.html.erb

<% end %>
<% pq = Question.find_by_page_and_num(@question.page,@question.num-1)%>
---
SELECT "questions".* FROM "questions" WHERE "questions"."page" = 91 AND "questions"."num" = 4 LIMIT 1