app/views/topics/index.html.erb

SELECT COUNT(*) FROM "questions" INNER JOIN "questions_topics" ON "questions"."id" = "questions_topics"."question_id" WHERE "questions_topics"."topic_id" = $1  [["topic_id", 2]]
---
        <td><%= topic.comments %></td>
        <td><%= topic.questions.count %>