app/views/topics/show.html.erb

  <strong>Contained in these questions:</strong>
<% @topic.questions.sort_by { |a| a.page*100+a.num }.each do |q| %>
---
SELECT "questions".* FROM "questions" INNER JOIN "questions_topics" ON "questions"."id" = "questions_topics"."question_id" WHERE "questions_topics"."topic_id" = $1  [["topic_id", 6]]