app/controllers/questions_controller.rb

  def index
    if @cur_page.nil?
      cp = Question.find_by_num("-1")
      if cp.nil?
        @cur_page = 1
      else
        @cur_page = cp.page.abs
---
SELECT "questions".* FROM "questions" WHERE "questions"."num" = -1 LIMIT 1
SELECT MAX("questions"."page") AS max_id FROM "questions"

  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("answer", "created_at", "level", "notes", "num", "page", "presenter1", "presenter2", "qimage", "qtext", "shortAnswer", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    params[:question][:topic_ids] ||=[]
    respond_to do |format|
      if @question.update(question_params)
---
UPDATE "questions" SET "answer" = $1, "aimage" = $2, "updated_at" = $3 WHERE "questions"."id" = 873  [["answer", "The lengths of the sides are integers, because of the right triangles that were made."], ["aimage", "PBL2_ans_2_4.PNG"], ["updated_at", Wed, 24 Jun 2015 01:19:02 UTC +00:00]]